kirti_test/pick_start_500/pick_order.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="csfoodkirti-mt.nmg4bpvfzm.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="3" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
	<users arrivalrate="5" unit="second"/>
	</arrivalphase>
	<arrivalphase phase="3" duration="30" unit="second">
	<users arrivalrate="20" unit="second"/>
	</arrivalphase>
	<arrivalphase phase="4" duration="30" unit="second">
	<users arrivalrate="100" unit="second"/>
	</arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511
      Firefox/1.0.4
      </user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="rndord1"/>
	<var name="rndord2"/>
	<var name="rndord3"/>
	<var name="rndord4"/>
	<var name="rndord5"/>
      </setdynvars>
      <request>
        <http url="/users/sign_in" version="1.1" method="GET"/>
      </request>
      <thinktime value="2" random="true"/>
      <request subst="true">
        <http url="/users/sign_in" version="1.1" method="POST" contents="user%5Blogin%5D=user1%40gmail.com&amp;user%5Bpassword%5D=test1234&amp;user%5Bremember_me%5D=0&amp;commit=Log+in"/>
      </request>
      <thinktime value="2" random="true"/>
      <request subst="true">
	<http url="/orders/%%_rndord1%%/pick" version="1.1" method="PUT"/>
      </request>
      </session>
  </sessions>
</tsung>